from sentence_transformers import SentenceTransformer
from pprint import pprint

def main():
    texts = [
        "На Дніпропетровщині та Запоріжжі частково відновлюють світло: яка зараз ситуація в регіонах",
        "“Надзвичайна ситуація національного рівня”: мер Дніпра Філатов розповів про стан справ в місті після блекауту",
        "Російські атаки залишили без світла Запорізьку та Дніпропетровську області ",
        "Запоріжжя знову зі світлом після масштабного блекауту. У Дніпрі електроенергії поки немає, ситуація складна",
        "На Дніпропетровщині без струму залишились 8 вугільних шахт (Відео)",
        "Трамп підтримав законопроект про санкції проти Росії",
        "Сенатор Грэм: Трамп одобрил законопроект о новых санкциях на российскую нефть",
        "В Україні відреагували на \"зелене світло\" від Трампа на санкції США проти Росії",
        "Трамп дав «зелене світло» санкційному законопроєкту проти росії — Ґрем",
        "Трамп дозволив Конгресу просунути санкційний законопроєкт проти партнерів Росії",
        "Шуфричу дозволили вийти з СІЗО під заставу",
        "Велика Британія передала Україні 13 систем ППО Raven і розпочала постачання Gravehawk",
        "Менше, ніж очікували: скільки своїх солдатів країни Заходу готові направити в Україну",
    ]

    model = SentenceTransformer(
        "sentence-transformers/paraphrase-multilingual-MiniLM-L12-v2"
    )

    embeddings = model.encode(
        texts,
        batch_size=16,
        show_progress_bar=True,
        normalize_embeddings=True  # ВАЖЛИВО для HDBSCAN
    )
    
    for e in embeddings:
        pprint(e)


if __name__ == "__main__":
    main()
